Revit 2024 API
IFamilyLoadOptions.OnFamilyFound Method
 A method called when the family was found in the target document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
bool OnFamilyFound(
	bool familyInUse,
	out bool overwriteParameterValues
)
Visual Basic
Function OnFamilyFound ( _
	familyInUse As Boolean, _
	<OutAttribute> ByRef overwriteParameterValues As Boolean _
) As Boolean
Visual C++
bool OnFamilyFound(
	bool familyInUse,
	[OutAttribute] bool% overwriteParameterValues
)
Parameters
familyInUse
Type: System.Boolean
 Indicates if one or more instances of the family is placed in the project.
overwriteParameterValues
Type: System.Boolean
 This determines whether or not to overwrite the parameter values of existing types. The default value is false.
Return Value
 Return true to continue loading the family, false to cancel.
Remarks
 Triggered only when the family is both loaded and changed.
See Also
IFamilyLoadOptions Interface
Autodesk.Revit.DB Namespace